# Utilizando SQL com Python

![title](img/sql.jpeg)

In [6]:
# load da biblioteca nb_black que transforma códigos para o padrão da PEP8

#!pip install nb_black

#%load_ext nb_black

%reload_ext nb_black

## Comados DDL:

- CREATE
- ALTER
- DROP

### CREATE

In [57]:
#importando a biblioteca Sqlite3 (nativa do Python, não precisa ser instalada)
#acesso ao módulo Sqlite3

import sqlite3

#a função .connect() retorna um objeto de conexão que usaremos para interagir com o BD
# contido no caminho especificado. No nosso caso esse BD ainda não existe. (será criado automaticamente)
conn = sqlite3.connect(".db")

# Criando um objeto cursor usando o método .cursor()
#esse método permite que enviemos instruções SQL para um banco de dados SQLite
cursor = conn.cursor()

# consulta para dropar a tabela se ela já existir
consulta = ''' '''

# executa a query que queremos no BD
cursor.execute(consulta)


# CRIEI UMA TABELA FUNCIONARIOS 

consulta = """ """

cursor.execute(consulta)
print("Tabela criada com sucesso........")

Tabela criada com sucesso........

## Comados DML:

- INSERT
- UPDATE
- DELETE

### INSERT

In [58]:
# Criando consultas de inserção de dados

cursor.execute(
    """ """
)

cursor.execute(
    """ """
)

cursor.execute(
    """ """
)

cursor.execute(
    """ """
)

cursor.execute(
    """ """
)

# Commit your changes in the database
conn.commit()
print("Dados inseridos.........")

Dados inseridos.........

### Comandos DQL

### SELECT

In [59]:
consulta = """ """

cursor.execute(consulta)

print(cursor.fetchall())

[(1, 'Pedro', 'Skooby', 35, 'M', 9000.0), (2, 'Maria', 'Silva', 28, 'F', 1200.0), (3, 'Luiza', 'Matos', 23, 'F', 3500.0), (4, 'Lorran', 'Oliveira', 32, 'M', 5000.0), (5, 'Bruno', 'Barbosa', 37, 'M', 6000.0)]

In [60]:
consulta = """ """

dados = cursor.execute(consulta)

for linha in dados:
    print(linha)

(1, 'Pedro', 'Skooby', 35, 'M', 9000.0)
(2, 'Maria', 'Silva', 28, 'F', 1200.0)
(3, 'Luiza', 'Matos', 23, 'F', 3500.0)
(4, 'Lorran', 'Oliveira', 32, 'M', 5000.0)
(5, 'Bruno', 'Barbosa', 37, 'M', 6000.0)

In [61]:
# importando a biblioteca pandas para análise de dados

import pandas as pd

conn = sqlite3.connect(".db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# Retornando a primeira linha da tabela
# result = cursor.fetchone()
# print(result)

# Retornando todas as linhas da tabela
# result = cursor.fetchall()
# print(result)

# comitando as mudanças para o BD
conn.commit()

# Lendo os dados da tabela em em DataFrame Pandas

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   1         Pedro      Skooby     35    M   9000.0
1   2         Maria       Silva     28    F   1200.0
2   3         Luiza       Matos     23    F   3500.0
3   4        Lorran    Oliveira     32    M   5000.0
4   5         Bruno     Barbosa     37    M   6000.0

## Comados DDL:

- CREATE
- ALTER
- DROP

### ALTER

In [62]:
nova_coluna = """ """

cursor.execute(nova_coluna)

dados = cursor.execute(""" """)

for linha in dados:
    print(linha)

conn.commit()

(1, 'Pedro', 'Skooby', 35, 'M', 9000.0, None)
(2, 'Maria', 'Silva', 28, 'F', 1200.0, None)
(3, 'Luiza', 'Matos', 23, 'F', 3500.0, None)
(4, 'Lorran', 'Oliveira', 32, 'M', 5000.0, None)
(5, 'Bruno', 'Barbosa', 37, 'M', 6000.0, None)

## Comados DML:

- INSERT
- UPDATE
- DELETE

#### UPDATE

In [63]:
inserir_usuarios = """ """

cursor.execute(inserir_usuarios)

inserir_usuarios = """ """

cursor.execute(inserir_usuarios)

inserir_usuarios = """ """

cursor.execute(inserir_usuarios)

inserir_usuarios = """ """

cursor.execute(inserir_usuarios)

inserir_usuarios = """ """

cursor.execute(inserir_usuarios)

dados = cursor.execute(""" """)

for linha in dados:
    print(linha)

conn.commit()

(1, 'Pedro', 'Skooby', 35, 'M', 9000.0, 'pskooby')
(2, 'Maria', 'Silva', 28, 'F', 1200.0, 'masilva')
(3, 'Luiza', 'Matos', 23, 'F', 3500.0, 'lumatos')
(4, 'Lorran', 'Oliveira', 32, 'M', 5000.0, 'loliveira')
(5, 'Bruno', 'Barbosa', 37, 'M', 6000.0, 'brunob')

#### DELETE

In [38]:
# DELETANDO TODOS OS REGISTROS DA TABELA FUNCIONARIOS

consulta = """ """

cursor.execute(consulta)

conn.commit()
print("Dados deletados.........")

Dados deletados.........

In [39]:
cursor.execute(""" """)
print(cursor.fetchall())

[]

### Outra maneira de inserir dados no BD:

In [1]:
# Criando consultas de inserção de dados

cursor.execute(
    """ """
)

conn.commit()
print("Dados inseridos.........")

cursor.execute("""SELECT * FROM FUNCIONARIOS""")
print(cursor.fetchall())

NameError: name 'cursor' is not defined

### Visualizando a tabela em formato de DF:

In [64]:
#importando a biblioteca pandas para análise de dados

import pandas as pd

conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """SELECT * from FUNCIONARIOS;"""

cursor.execute(consulta)

# Retornando a primeira linha da tabela
# result = cursor.fetchone()
# print(result)

# Retornando todas as linhas da tabela
# result = cursor.fetchall()
# print(result)

# comitando as mudanças para o BD
conn.commit()

# Lendo os dados da tabela em em DataFrame Pandas

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario    usuario
0   1         Pedro      Skooby     35    M   9000.0    pskooby
1   2         Maria       Silva     28    F   1200.0    masilva
2   3         Luiza       Matos     23    F   3500.0    lumatos
3   4        Lorran    Oliveira     32    M   5000.0  loliveira
4   5         Bruno     Barbosa     37    M   6000.0     brunob

## Comados DDL:

- CREATE
- ALTER
- DROP

In [44]:
consulta = """DROP TABLE FUNCIONARIOS;"""

cursor.execute(consulta)

print("Tabela excluida com sucesso........")

Tabela excluida com sucesso........

### Visualizando os tabelas no BD:

In [46]:
# CRIEI UM TABELA CONTATOS

consulta = """ """

cursor.execute(consulta)

print("Tabela criada com sucesso........")

Tabela criada com sucesso........

In [47]:
# Criando consultas de inserção de dados

cursor.execute(""" """)

conn.commit()
print("Dados inseridos.........")

cursor.execute("""SELECT * FROM CONTATOS""")
print(cursor.fetchall())

Dados inseridos.........
[(1, '22998765412', 'skooby@emailegal.com', 'Brasil'), (2, '23998773456', 'msilva@emailqualquer.com', 'Brasil'), (3, '27999523211', 'luizamatos@yahoo.com', 'Argentina'), (4, '21998577621', 'lorranoliveir@gemail.com', 'Cuba'), (5, '31998756423', 'bbarb@email.com', 'Uruguay'), (6, '35998756234', 'dariojulio@gmail1.com', 'EUA'), (7, '21997844526', 'joaquim@emailqualquer.com', 'Brasil')]

In [66]:
consulta = """SELECT * FROM contatos;"""

cursor.execute(consulta)

# Retornando a primeira linha da tabela
# result = cursor.fetchone()
# print(result)

# Retornando todas as linhas da tabela
# result = cursor.fetchall()
# print(result)

# comitando as mudanças para o BD
conn.commit()

# Lendo os dados da tabela em em DataFrame Pandas

df = pd.read_sql(consulta, conn)

df

   id_funcionario     telefone                      email       pais
0               1  22998765412       skooby@emailegal.com     Brasil
1               2  23998773456   msilva@emailqualquer.com     Brasil
2               3  27999523211       luizamatos@yahoo.com  Argentina
3               4  21998577621   lorranoliveir@gemail.com       Cuba
4               5  31998756423            bbarb@email.com    Uruguay
5               6  35998756234      dariojulio@gmail1.com        EUA
6               7  21997844526  joaquim@emailqualquer.com     Brasil

In [67]:
show_tables()

              name   type
0  sqlite_sequence  table
1         CONTATOS  table
2     FUNCIONARIOS  table

### Comandos DQL:

- SELECT

   - retornar id, primeiro e ultimo nome da tabela funcionarios:

In [35]:
consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome
0   1         Pedro      Skooby
1   2         Maria       Silva
2   3         Luiza       Matos
3   4        Lorran    Oliveira
4   5         Bruno     Barbosa

- retornar id, email da tabela contatos:

In [ ]:
consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

### Comandos DQL:

- SELECT e WHERE

- trazer todos os dados da tabela funcionarios, onde a idade seja menor que 30 anos:

In [40]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   2         Maria       Silva     28    F   1200.0
1   3         Luiza       Matos     23    F   3500.0

- Retornar o funcionário de id = 1

In [41]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   1         Pedro      Skooby     35    M   9000.0

- retornar todas as informações dos funcionários com salário maior que 3000:

In [42]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   1         Pedro      Skooby     35    M   9000.0
1   3         Luiza       Matos     23    F   3500.0
2   4        Lorran    Oliveira     32    M   5000.0
3   5         Bruno     Barbosa     37    M   6000.0


- Trazer da tabela 'FUNCIONARIOS' nome, sobrenome e idade dos funcionarios que tem salário acima de R$3000 e idade menor que 35:

In [43]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   1         Pedro      Skooby     35    M   9000.0
1   3         Luiza       Matos     23    F   3500.0
2   4        Lorran    Oliveira     32    M   5000.0

### Comandos DQL:

- SELECT e ORDER BY

- Trazer todas as informações do funcionário mas ordenadas pela idade de maneira crescente:

In [44]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   3         Luiza       Matos     23    F   3500.0
1   2         Maria       Silva     28    F   1200.0
2   4        Lorran    Oliveira     32    M   5000.0
3   1         Pedro      Skooby     35    M   9000.0
4   5         Bruno     Barbosa     37    M   6000.0

- nome, idade e salário dos funcionários, ordenados pelo salário de maneira decrescente:

In [45]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario
0   1         Pedro      Skooby     35    M   9000.0
1   5         Bruno     Barbosa     37    M   6000.0
2   4        Lorran    Oliveira     32    M   5000.0
3   3         Luiza       Matos     23    F   3500.0
4   2         Maria       Silva     28    F   1200.0

- trazer todos os dados dos funcionários onde o salário é maior que 3000 e a idade menor que 35 anos, ordenados pelo salário de maneira decrescente.

In [68]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario    usuario
0   1         Pedro      Skooby     35    M   9000.0    pskooby
1   4        Lorran    Oliveira     32    M   5000.0  loliveira
2   3         Luiza       Matos     23    F   3500.0    lumatos

- trazer nome, idade e salario dos funcionarios com salário entre 3000 e 5000, com idade menor que 35 anos, ordenados por idade de maneira decrescente.

In [72]:
conn = sqlite3.connect("exemplo.db")

cursor = conn.cursor()

consulta = """ """

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

   id primeiro_nome ultimo_nome  idade sexo  salario    usuario
0   4        Lorran    Oliveira     32    M   5000.0  loliveira
1   3         Luiza       Matos     23    F   3500.0    lumatos

### JOINS

![title](img/inner_join.png)

In [73]:
consulta = """SELECT
    f.primeiro_nome AS Nome,
    f.ultimo_nome AS Sobrenome,
    c.email 
FROM
    FUNCIONARIOS f
INNER JOIN CONTATOS c ON f.id = c.id_funcionario;"""

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

     Nome Sobrenome                     email
0   Pedro    Skooby      skooby@emailegal.com
1   Maria     Silva  msilva@emailqualquer.com
2   Luiza     Matos      luizamatos@yahoo.com
3  Lorran  Oliveira  lorranoliveir@gemail.com
4   Bruno   Barbosa           bbarb@email.com

![title](img/left_join.png)

In [74]:
consulta = """SELECT
    f.primeiro_nome AS Nome,
    f.ultimo_nome AS Sobrenome,
    c.email 
FROM
    FUNCIONARIOS f
LEFT OUTER JOIN CONTATOS c ON f.id = c.id_funcionario;"""

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

     Nome Sobrenome                     email
0   Pedro    Skooby      skooby@emailegal.com
1   Maria     Silva  msilva@emailqualquer.com
2   Luiza     Matos      luizamatos@yahoo.com
3  Lorran  Oliveira  lorranoliveir@gemail.com
4   Bruno   Barbosa           bbarb@email.com

![title](img/rigth_join.png)

In [75]:
consulta = """SELECT
    f.primeiro_nome AS Nome,
    f.ultimo_nome AS Sobrenome,
    c.email 
FROM
    CONTATOS c 
LEFT OUTER JOIN FUNCIONARIOS f ON c.id_funcionario = f.id;"""

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

     Nome Sobrenome                      email
0   Pedro    Skooby       skooby@emailegal.com
1   Maria     Silva   msilva@emailqualquer.com
2   Luiza     Matos       luizamatos@yahoo.com
3  Lorran  Oliveira   lorranoliveir@gemail.com
4   Bruno   Barbosa            bbarb@email.com
5    None      None      dariojulio@gmail1.com
6    None      None  joaquim@emailqualquer.com

In [76]:
consulta = """SELECT
    f.primeiro_nome AS Nome,
    f.ultimo_nome AS Sobrenome,
    c.email 
FROM
    FUNCIONARIOS f
CROSS JOIN CONTATOS c;"""

cursor.execute(consulta)

# print(cursor.fetchall())

df = pd.read_sql(consulta, conn)

df

      Nome Sobrenome                      email
0    Pedro    Skooby       skooby@emailegal.com
1    Pedro    Skooby   msilva@emailqualquer.com
2    Pedro    Skooby       luizamatos@yahoo.com
3    Pedro    Skooby   lorranoliveir@gemail.com
4    Pedro    Skooby            bbarb@email.com
5    Pedro    Skooby      dariojulio@gmail1.com
6    Pedro    Skooby  joaquim@emailqualquer.com
7    Maria     Silva       skooby@emailegal.com
8    Maria     Silva   msilva@emailqualquer.com
9    Maria     Silva       luizamatos@yahoo.com
10   Maria     Silva   lorranoliveir@gemail.com
11   Maria     Silva            bbarb@email.com
12   Maria     Silva      dariojulio@gmail1.com
13   Maria     Silva  joaquim@emailqualquer.com
14   Luiza     Matos       skooby@emailegal.com
15   Luiza     Matos   msilva@emailqualquer.com
16   Luiza     Matos       luizamatos@yahoo.com
17   Luiza     Matos   lorranoliveir@gemail.com
18   Luiza     Matos            bbarb@email.com
19   Luiza     Matos      dariojulio@gmail1.com
20   Luiza     Matos  joaquim@emailqualquer.com
21  Lorran  Oliveira       skooby@emailegal.com
22  Lorran  Oliveira   msilva@emailqualquer.com
23  Lorran  Oliveira       luizamatos@yahoo.com
24  Lorran  Oliveira   lorranoliveir@gemail.com
25  Lorran  Oliveira            bbarb@email.com
26  Lorran  Oliveira      dariojulio@gmail1.com
27  Lorran  Oliveira  joaquim@emailqualquer.com
28   Bruno   Barbosa       skooby@emailegal.com
29   Bruno   Barbosa   msilva@emailqualquer.com
30   Bruno   Barbosa       luizamatos@yahoo.com
31   Bruno   Barbosa   lorranoliveir@gemail.com
32   Bruno   Barbosa            bbarb@email.com
33   Bruno   Barbosa      dariojulio@gmail1.com
34   Bruno   Barbosa  joaquim@emailqualquer.com

In [77]:
# Fechando a conexão com o BD

conn.close()

## CRIANDO UM NOVO BD:

In [86]:
# importando a biblioteca Sqlite3 (nativa do Python, não precisa ser instalada)
# acesso ao módulo Sqlite3

import sqlite3

# a função .connect() retorna um objeto de conexão que usaremos para interagir com o BD
# contido no caminho especificado. No nosso caso esse BD ainda não existe. (será criado automaticamente)
conn = sqlite3.connect("exemplo1.db")

# Criando um objeto cursor usando o método .cursor()
# esse método permite que enviemos instruções SQL para um banco de dados SQLite
cursor = conn.cursor()


# TABELA_A
# consulta para dropar a tabela se ela já existir
consulta = """DROP TABLE IF EXISTS TABELA_A"""

# executa a query que queremos no BD
cursor.execute(consulta)


# CRIEI UMA TABELA FUNCIONARIOS

consulta = """CREATE TABLE TABELA_A (id INTEGER PRIMARY KEY, nome TEXT);"""

cursor.execute(consulta)
print("TABELA_A criada com sucesso........")

# TABELA_B
# consulta para dropar a tabela se ela já existir
consulta = """DROP TABLE IF EXISTS TABELA_B"""

# executa a query que queremos no BD
cursor.execute(consulta)


# CRIEI UMA TABELA FUNCIONARIOS

consulta = """CREATE TABLE TABELA_B (id INTEGER PRIMARY KEY, nome TEXT);"""

cursor.execute(consulta)
print("TABELA_B criada com sucesso........")

TABELA_A criada com sucesso........
TABELA_B criada com sucesso........

In [87]:
# Criando consultas de inserção de dados

cursor.execute(
    """INSERT INTO TABELA_A (nome)
        VALUES 
        ("nome_1"),
        ("nome_2"),
        ("nome_3"),
        ("nome_4");
        """
)

conn.commit()
print("Dados inseridos.........")

dados = cursor.execute("""SELECT * from TABELA_A""")
#print(cursor.fetchall())

for linha in dados:
    print(linha)

Dados inseridos.........
(1, 'nome_1')
(2, 'nome_2')
(3, 'nome_3')
(4, 'nome_4')

In [88]:
# Criando consultas de inserção de dados

cursor.execute(
    """INSERT INTO TABELA_B (nome)
        VALUES 
        ("nome_5"),
        ("nome_1"),
        ("nome_6"),
        ("nome_3");
        """
)

conn.commit()
print("Dados inseridos.........")

dados = cursor.execute("""SELECT * from TABELA_B""")
#print(cursor.fetchall())

for linha in dados:
    print(linha)

Dados inseridos.........
(1, 'nome_5')
(2, 'nome_1')
(3, 'nome_6')
(4, 'nome_3')

#### INNER JOIN

![title](img/inner_join.png)

In [89]:
consulta = """ SELECT *
               FROM TABELA_A
               INNER JOIN TABELA_B
               ON TABELA_A.nome = TABELA_B.nome;
               """

cursor.execute(consulta)

df = pd.read_sql(consulta, conn)

df

   id    nome  id    nome
0   1  nome_1   2  nome_1
1   3  nome_3   4  nome_3

#### LEFT OUTER JOIN

![title](img/left_join.png)

In [94]:
consulta = """ SELECT *
               FROM TABELA_A
               LEFT JOIN TABELA_B
               ON TABELA_A.nome = TABELA_B.nome;"""

cursor.execute(consulta)

df = pd.read_sql(consulta, conn)

df

   id    nome   id    nome
0   1  nome_1  2.0  nome_1
1   2  nome_2  NaN    None
2   3  nome_3  4.0  nome_3
3   4  nome_4  NaN    None

#### RIGTH OUTER JOIN

![title](img/rigth_join.png)

In [91]:
consulta = """ SELECT *
               FROM TABELA_B
               LEFT OUTER JOIN TABELA_A
               ON TABELA_A.nome = TABELA_B.nome;"""

cursor.execute(consulta)

df = pd.read_sql(consulta, conn)

df

   id    nome   id    nome
0   1  nome_5  NaN    None
1   2  nome_1  1.0  nome_1
2   3  nome_6  NaN    None
3   4  nome_3  3.0  nome_3

#### EMULANDO FULL OUTER JOIN

![title](img/full_join.png)

In [93]:
consulta = """  SELECT TABELA_A.id, TABELA_A.nome, TABELA_B.id, TABELA_B.nome
                FROM TABELA_A
                LEFT JOIN TABELA_B USING(nome)
                UNION ALL
                SELECT TABELA_A.id, TABELA_A.nome, TABELA_B.id, TABELA_B.nome
                FROM TABELA_B
                LEFT JOIN TABELA_A USING(nome)
                WHERE TABELA_A.nome IS NULL;"""

cursor.execute(consulta)

df = pd.read_sql(consulta, conn)

df

    id    nome   id    nome
0  1.0  nome_1  2.0  nome_1
1  2.0  nome_2  NaN    None
2  3.0  nome_3  4.0  nome_3
3  4.0  nome_4  NaN    None
4  NaN    None  1.0  nome_5
5  NaN    None  3.0  nome_6

referências: https://danielle-leppert-simenauer.medium.com/sqlite-complex-joins-32459860bcb7
             https://www.techagilist.com/mainframe/db2/db2-join-inner-joins-and-outer-joins/

In [85]:
# Fechando a conexão com o BD

conn.close()